alishabana99/stm32f407-disc-board-drivers/Lib/memory_map.h
/*
 * @file memory_map.h
 * @author Ali Shabana
 * @date June 30, 2023
 *
 * @brief General Header file.
 * 		- This file contains Peripherals' typedefs, register mapping, and bit mapping of each register.
 * 		- The file is divided according the levels inside the memory map:
 * 			- Main Memory blocks in the memory map, each one has
 * 				- Buses, each bus has
 * 					- Peripherals, each peripheral has
 * 						- Registers, each register has
 * 							- Bits
 *
 */

#ifndef MEMORY_MAP_H_
#define MEMORY_MAP_H_

#include <stdint.h>


/*********Cortex-M4's internal peripherals Block*****************/
/**
 * @def CORTEX_M4_PERIPH_BASE
 * @brief The base address of Cortex-M4's internal peripherals Block in ARM's memory map.
 * 512-Mbyte block 7 Cortex-M4's internal peripherals
 * (0xE000 0000UL - 0xE00F FFFF)
 */
#define CORTEX_M4_PERIPH_BASE		(0xE0000000UL)

/**
 * @defgroup Peripherals_offsets_and_bases_from_CORTEX_M4_PERIPH_Bus_Base
 * @brief It's driven by the SystemClock or other(configurable).
 *
 */

#define	SysTick_OFFSET				(0x0000E000UL)
#define SysTick_BASE	(CORTEX_M4_PERIPH_BASE + SysTick_OFFSET)




/*********Peripheral Block*****************/
/**
 * @def PERIPH_BASE
 * @brief The base address of the peripherals in ARM's memory map.
 * 512-Mbyte block 2 Peripherals
 * (0x4000 0000 - 5FFF FFFF)
 */
#define PERIPH_BASE 				(0x40000000UL)

#define APB1_OFFSET (0x00000000UL)
#define APB2_OFFSET (0x00010000UL)
#define AHB1_OFFSET (0x00020000UL)



/**
 * @defgroup Base addresses
 * 	- Now we are standing on the {x} Bus, We have access to all peripherals that connected to it.
 * 	- And once we have reach the peripheral, we can reach each register inside it using systematic offsets.
 * 	- And inside each register we can access any bit as desired.
 */

#define APB1_BASE	(PERIPH_BASE + APB1_OFFSET)
#define APB2_BASE	(PERIPH_BASE + APB2_OFFSET)
#define AHB1_BASE	(PERIPH_BASE + AHB1_OFFSET)

/**
 * @defgroup Peripherals_offsets_and_bases_from_APB1_Bus_Base
 * @brief once we have reach the peripheral, we can reach each register inside it using systematic offsets.
 */
#define USART2_OFFSET	(0x00004400UL)
#define USART2_BASE		(APB1_BASE + USART2_OFFSET)

#define USART3_OFFSET	(0x00004800UL)
#define USART3_BASE		(APB1_BASE + USART3_OFFSET)

#define USART4_OFFSET	(0x00004C00UL)
#define USART4_BASE		(APB1_BASE + USART4_OFFSET)

#define USART5_OFFSET	(0x00005000UL)
#define USART5_BASE		(APB1_BASE + USART5_OFFSET)


/**
 * @defgroup Peripherals_offsets_and_bases_from_APB2_Bus_Base
 * @brief once we have reach the peripheral, we can reach each register inside it using systematic offsets.
 */
#define USART1_OFFSET	(0x00001000UL)
#define USART1_BASE		(APB2_BASE + USART1_OFFSET)

#define USART6_OFFSET	(0x00001400UL)
#define USART6_BASE		(APB2_BASE + USART6_OFFSET)


#define ADC_OFFSET		(0x00002000UL)
#define ADC_BASE		(APB2_BASE + ADC_OFFSET)

#define ADC1_OFFSET		(0x00000000UL)
#define ADC1_BASE		(ADC_BASE + ADC1_OFFSET)

#define ADC2_OFFSET		(0x00000100UL)
#define ADC2_BASE		(ADC_BASE + ADC2_OFFSET)

#define ADC3_OFFSET		(0x00000200UL)
#define ADC3_BASE		(ADC_BASE + ADC3_OFFSET)

#define ADC_COMMON_OFFSET		(0x00000300UL)
#define ADC_COMMON_BASE			(ADC1_BASE + ADC_COMMON_OFFSET)  /*RM:  relative to ADC1 base address + 0x300*/

/**
 * @defgroup Peripherals_offsets_and_bases_from_AHB1_Bus_Base
 * @brief once we have reach the peripheral, we can reach each register inside it using systematic offsets.
 */
#define GPIOA_OFFSET	(0x00000000UL)
#define GPIOA_BASE		(AHB1_BASE + GPIOA_OFFSET)

#define GPIOB_OFFSET	(0x00000400UL)
#define GPIOB_BASE		(AHB1_BASE + GPIOB_OFFSET)

#define GPIOC_OFFSET	(0x00000800UL)
#define GPIOC_BASE		(AHB1_BASE + GPIOC_OFFSET)

#define GPIOD_OFFSET	(0x00000C00UL)
#define GPIOD_BASE		(AHB1_BASE + GPIOD_OFFSET)

#define GPIOE_OFFSET	(0x00001000UL)
#define GPIOE_BASE		(AHB1_BASE + GPIOE_OFFSET)

#define GPIOH_OFFSET	(0x00001C00UL)
#define GPIOH_BASE		(AHB1_BASE + GPIOH_OFFSET)

#define RCC_OFFSET	(0x00003800UL)
#define RCC_BASE		(AHB1_BASE + RCC_OFFSET)




/*_________________________________________________________________________________________*/
/**
 * @defgroup Peripherals registers mapping using structs.
 * Details:
 *
 *
 *  */
typedef struct{
	volatile uint32_t MODER;
	volatile uint32_t OTYPER;
	volatile uint32_t OSPEEDR;
	volatile uint32_t PUPDR;
	volatile uint32_t IDR;
	volatile uint32_t ODR;
	volatile uint32_t BSRR;
	volatile uint32_t LCKR;
	volatile uint32_t AFRL;
	volatile uint32_t AFRH;
}GPIO_t;

typedef struct
{
	  volatile uint32_t CR;            /*!< RCC clock control register,                                  Address offset: 0x00 */
	  volatile uint32_t PLLCFGR;       /*!< RCC PLL configuration register,                              Address offset: 0x04 */
	  volatile uint32_t CFGR;          /*!< RCC clock configuration register,                            Address offset: 0x08 */
	  volatile uint32_t CIR;           /*!< RCC clock interrupt register,                                Address offset: 0x0C */
	  volatile uint32_t AHB1RSTR;      /*!< RCC AHB1 peripheral reset register,                          Address offset: 0x10 */
	  volatile uint32_t AHB2RSTR;      /*!< RCC AHB2 peripheral reset register,                          Address offset: 0x14 */
	  volatile uint32_t AHB3RSTR;      /*!< RCC AHB3 peripheral reset register,                          Address offset: 0x18 */
	  uint32_t      RESERVED0;     /*!< Reserved, 0x1C                                                                    */
	  volatile uint32_t APB1RSTR;      /*!< RCC APB1 peripheral reset register,                          Address offset: 0x20 */
	  volatile uint32_t APB2RSTR;      /*!< RCC APB2 peripheral reset register,                          Address offset: 0x24 */
	  uint32_t      RESERVED1[2];  /*!< Reserved, 0x28-0x2C                                                               */
	  volatile uint32_t AHB1ENR;       /*!< RCC AHB1 peripheral clock register,                          Address offset: 0x30 */
	  volatile uint32_t AHB2ENR;       /*!< RCC AHB2 peripheral clock register,                          Address offset: 0x34 */
	  volatile uint32_t AHB3ENR;       /*!< RCC AHB3 peripheral clock register,                          Address offset: 0x38 */
	  uint32_t      RESERVED2;     /*!< Reserved, 0x3C                                                                    */
	  volatile uint32_t APB1ENR;       /*!< RCC APB1 peripheral clock enable register,                   Address offset: 0x40 */
	  volatile uint32_t APB2ENR;       /*!< RCC APB2 peripheral clock enable register,                   Address offset: 0x44 */
	  uint32_t      RESERVED3[2];  /*!< Reserved, 0x48-0x4C                                                               */
	  volatile uint32_t AHB1LPENR;     /*!< RCC AHB1 peripheral clock enable in low power mode register, Address offset: 0x50 */
	  volatile uint32_t AHB2LPENR;     /*!< RCC AHB2 peripheral clock enable in low power mode register, Address offset: 0x54 */
	  volatile uint32_t AHB3LPENR;     /*!< RCC AHB3 peripheral clock enable in low power mode register, Address offset: 0x58 */
	  uint32_t      RESERVED4;     /*!< Reserved, 0x5C                                                                    */
	  volatile uint32_t APB1LPENR;     /*!< RCC APB1 peripheral clock enable in low power mode register, Address offset: 0x60 */
	  volatile uint32_t APB2LPENR;     /*!< RCC APB2 peripheral clock enable in low power mode register, Address offset: 0x64 */
	  uint32_t      RESERVED5[2];  /*!< Reserved, 0x68-0x6C                                                               */
	  volatile uint32_t BDCR;          /*!< RCC Backup domain control register,                          Address offset: 0x70 */
	  volatile uint32_t CSR;           /*!< RCC clock control & status register,                         Address offset: 0x74 */
	  uint32_t      RESERVED6[2];  /*!< Reserved, 0x78-0x7C                                                               */
	  volatile uint32_t SSCGR;         /*!< RCC spread spectrum clock generation register,               Address offset: 0x80 */
	  volatile uint32_t PLLI2SCFGR;    /*!< RCC PLLI2S configuration register,                           Address offset: 0x84 */

} RCC_t;


