alishabana99/stm32f407-disc-board-drivers/Lib/memory_map.h
typedef struct{

	volatile uint32_t RESERVED0[4];		/*Reserved, 0xE000-0xE010*/
	volatile uint32_t CSR;			/*SysTick Control And Status Register		OFFSET: 0x10*/
	volatile uint32_t RVR;			/*SysTick Reload Value Register				OFFSET:	0x14*/
	volatile uint32_t CVR;			/*SysTick Current Value Register			OFFSET:	0x18*/
	volatile uint32_t CALIB;		/*SysTick Calibration Value Register		OFFSET:	0x1C*/
}SysTick_t;


typedef struct{

	volatile uint32_t SR;	/*USART Status Register*/
	volatile uint32_t DR;	/*USART Data Register*/
	volatile uint32_t BRR;	/*USART Baud Rate Register*/
	volatile uint32_t CR1;	/*USART Control Register1*/
	volatile uint32_t CR2;	/*USART Control Register2*/
	volatile uint32_t CR3;	/*USART Control Register3*/
	volatile uint32_t GTPR;	/*USART Guard time and prescaler register*/
}USART_t;



typedef struct
{
  volatile uint32_t SR;     /*!< ADC status register,                         Address offset: 0x00 */
  volatile uint32_t CR1;    /*!< ADC control register 1,                      Address offset: 0x04 */
  volatile uint32_t CR2;    /*!< ADC control register 2,                      Address offset: 0x08 */
  volatile uint32_t SMPR1;  /*!< ADC sample time register 1,                  Address offset: 0x0C */
  volatile uint32_t SMPR2;  /*!< ADC sample time register 2,                  Address offset: 0x10 */
  volatile uint32_t JOFR1;  /*!< ADC injected channel data offset register 1, Address offset: 0x14 */
  volatile uint32_t JOFR2;  /*!< ADC injected channel data offset register 2, Address offset: 0x18 */
  volatile uint32_t JOFR3;  /*!< ADC injected channel data offset register 3, Address offset: 0x1C */
  volatile uint32_t JOFR4;  /*!< ADC injected channel data offset register 4, Address offset: 0x20 */
  volatile uint32_t HTR;    /*!< ADC watchdog higher threshold register,      Address offset: 0x24 */
  volatile uint32_t LTR;    /*!< ADC watchdog lower threshold register,       Address offset: 0x28 */
  volatile uint32_t SQR1;   /*!< ADC regular sequence register 1,             Address offset: 0x2C */
  volatile uint32_t SQR2;   /*!< ADC regular sequence register 2,             Address offset: 0x30 */
  volatile uint32_t SQR3;   /*!< ADC regular sequence register 3,             Address offset: 0x34 */
  volatile uint32_t JSQR;   /*!< ADC injected sequence register,              Address offset: 0x38*/
  volatile uint32_t JDR1;   /*!< ADC injected data register 1,                Address offset: 0x3C */
  volatile uint32_t JDR2;   /*!< ADC injected data register 2,                Address offset: 0x40 */
  volatile uint32_t JDR3;   /*!< ADC injected data register 3,                Address offset: 0x44 */
  volatile uint32_t JDR4;   /*!< ADC injected data register 4,                Address offset: 0x48 */
  volatile uint32_t DR;     /*!< ADC regular data register,                   Address offset: 0x4C */
}ADC_t;



typedef struct
{
  volatile uint32_t CSR;    /*!< ADC Common status register,                  Address offset: ADC1 base address + 0x300 */
  volatile uint32_t CCR;    /*!< ADC common control register,                 Address offset: ADC1 base address + 0x304 */
  volatile uint32_t CDR;    /*!< ADC common regular data register for dual
                             AND triple modes,                            Address offset: ADC1 base address + 0x308 */
}ADC_Common_t;


/*_________________________________________________________________________________________*/
/**
 * @defgroup Peripherals Bases casted to their structs types.
 * Details:
 *  */

#define RCC		((RCC_t*)RCC_BASE)

#define GPIOA	((GPIO_t*)GPIOA_BASE)
#define GPIOB	((GPIO_t*)GPIOB_BASE)
#define GPIOC	((GPIO_t*)GPIOC_BASE)
#define GPIOD	((GPIO_t*)GPIOD_BASE)
#define GPIOE	((GPIO_t*)GPIOE_BASE)
#define GPIOH	((GPIO_t*)GPIOH_BASE)

#define SysTick	((SysTick_t*)SysTick_BASE)

#define USART1	((USART_t*)USART1_BASE)
#define USART2	((USART_t*)USART2_BASE)
#define USART3	((USART_t*)USART3_BASE)
#define USART4	((USART_t*)USART4_BASE)
#define USART5	((USART_t*)USART5_BASE)
#define USART6	((USART_t*)USART6_BASE)

#define ADC1	((ADC_t*)ADC1_BASE)
#define ADC2	((ADC_t*)ADC2_BASE)
#define ADC3	((ADC_t*)ADC3_BASE)
#define ADC_COMMON	((ADC_Common_t*)ADC_COMMON_BASE)

/*____________________________________________________________________________________________*/
/*____________________________________RCC Registers Bits_____________________________________*/
/*____________________________________________________________________________________________*/

/* #RCC_CR ############################ */
#define RCC_CR_HSION				0
#define RCC_CR_HSIRDY				1
//________________RES				2
#define RCC_CR_HSITRIM				3	//[3-7]
#define RCC_CR_HSICAL				8	//[8-15]
#define RCC_CR_HSEON				16
#define RCC_CR_HSERDY				17
#define RCC_CR_BYB					18
#define RCC_CR_CSSON				19
//____________RES					[20-23]
#define RCC_CR_PLLON				24
#define RCC_CR_PLLRDY				25
#define RCC_CR_PLLI2SON				26
#define RCC_CR_PLLI2SRDY			27
//____________RES					[28-31]

/* #RCC_PLLCFGR ############################ */
#define RCC_PLLCFGR_PLLM0			0
#define RCC_PLLCFGR_PLLM1			1
#define RCC_PLLCFGR_PLLM2			2
#define RCC_PLLCFGR_PLLM3			3
#define RCC_PLLCFGR_PLLM4			4
#define RCC_PLLCFGR_PLLM5			5
#define RCC_PLLCFGR_PLLN			6	//[6-14]
//____________RES					15
#define RCC_PLLCFGR_PLLP0			16
#define RCC_PLLCFGR_PLLP1			17
//____________RES					[18-21]
#define RCC_PLLCFGR_PLLSRC			22
//____________RES					23
#define RCC_PLLCFGR_PLLQ0			24
#define RCC_PLLCFGR_PLLQ1			25
#define RCC_PLLCFGR_PLLQ2			26
#define RCC_PLLCFGR_PLLQ3			27
//____________RES					[28-31]

/* #RCC_CFGR ############################ */
#define RCC_CFGR_SW0				0
#define RCC_CFGR_SW1				1
#define RCC_CFGR_SWS0				2
#define RCC_CFGR_SWS1				3
#define RCC_CFGR_HPRE				4	//[4-7]
//____________RES					[8-9]
#define RCC_CFGR_PPRE1				10	//[10-12]
#define RCC_CFGR_PPRE2				13	//[13-15]
#define RCC_CFGR_RTCPRE				16	//[16-20]
#define RCC_CFGR_MCO1				21	//[21-22]
#define RCC_CFGR_I2SSCR				23
#define RCC_CFGR_MCO1PRE			24	//[24-26]
#define RCC_CFGR_MCO2PRE			27	//[27-29]
#define RCC_CFGR_MCO2				30	//[30-31]

/* #RCC_CIR ############################ */
#define RCC_CIR_LSIRDYF				0
#define RCC_CIR_LSERDYF				1
#define RCC_CIR_HSIRDYF				2
#define RCC_CIR_HSERDYF				3
#define RCC_CIR_PLLRDYF				4
#define RCC_CIR_PLLI2SRDYF			5
//____________RES					6
#define RCC_CIR_CSSF				7
#define RCC_CIR_LSIRDYIE			8
#define RCC_CIR_LSERDYIE			9
#define RCC_CIR_HSIRDYIE			10
#define RCC_CIR_HSERDYIE			11
#define RCC_CIR_PLLRDYIE			12
#define RCC_CIR_PLLI2SRDYIE			13
//____________RES					[14-15]
#define RCC_CIR_LSIRDYC				16
#define RCC_CIR_LSERDYC				17
#define RCC_CIR_HSIRDYC				18
#define RCC_CIR_HSERDYC				19
#define RCC_CIR_PLLRDYC				20
#define RCC_CIR_PLLI2SRDYC			21
//____________RES					22
#define RCC_CIR_CSSC				23
//____________RES					[24-31]

/* #RCC_AHB1RSTR ############################ */
#define RCC_AHB1RSTR_GPIOARST		0
#define RCC_AHB1RSTR_GPIOBRST		1
#define RCC_AHB1RSTR_GPIOCRST		2
#define RCC_AHB1RSTR_GPIODRST		3
#define RCC_AHB1RSTR_GPIOERST		4
#define RCC_AHB1RSTR_GPIOFRST		5
#define RCC_AHB1RSTR_GPIOGRST		6
#define RCC_AHB1RSTR_GPIOHRST		7
#define RCC_AHB1RSTR_GPIOIRST		8
//____________RES					[9-11]
#define RCC_AHB1RSTR_CRCRST			12
//____________RES					[13-20]
#define RCC_AHB1RSTR_DMA1RST		21
#define RCC_AHB1RSTR_DMA2RST		22
//____________RES					[23-24]
#define RCC_AHB1RSTR_ETHMACRST		25
//____________RES					[26-28]
#define RCC_AHB1RSTR_OTGHSRST		29
//____________RES					[30-31]

/* #RCC_AHB2RSTR ############################ */
#define RCC_AHB2RSTR_DCMIRST		0
//____________RES					[1-3]
#define RCC_AHB2RSTR_CRYPRST		4
#define RCC_AHB2RSTR_HASHRST		5
#define RCC_AHB2RSTR_RNGRST			6
#define RCC_AHB2RSTR_OTGFSRST		7
//____________RES					[8-31]

/* #RCC_AHB3RSTR ############################ */
#define RCC_AHB2RSTR_FSMCRST		0
//____________RES					[2-31]

/* #RCC_APB1ENR ############################ */
#define RCC_APB1ENR_TIM2RST		0
#define RCC_APB1ENR_TIM3RST		1
#define RCC_APB1ENR_TIM4RST		2
#define RCC_APB1ENR_TIM5RST		3
#define RCC_APB1ENR_TIM6RST		4
#define RCC_APB1ENR_TIM7RST		5
#define RCC_APB1ENR_TIM12RST		6
#define RCC_APB1ENR_TIM13RST		7
#define RCC_APB1ENR_TIM14RST		8
//____________RES					[9-10]
#define RCC_APB1ENR_WWDGRST		11
//____________RES					[12-13]
#define RCC_APB1ENR_SPI2RST		14
#define RCC_APB1ENR_SPI3RST		15
//____________RES					16
#define RCC_APB1ENR_UART2RST		17
#define RCC_APB1ENR_UART3RST		18
#define RCC_APB1ENR_UART4RST		19
#define RCC_APB1ENR_UART5RST		20
#define RCC_APB1ENR_I2C1RST		21
#define RCC_APB1ENR_I2C2RST		22
#define RCC_APB1ENR_I2C3RST		23
//____________RES					24
#define RCC_APB1ENR_CAN1RST		25
#define RCC_APB1ENR_CAN2RST		26
//____________RES					27
#define RCC_APB1ENR_PWRRST			28
#define RCC_APB1ENR_DACRST			29
//____________RES					[30-31]

/* #RCC_APB2RSTR ############################ */
#define RCC_APB2RSTR_TIM1RST		0
#define RCC_APB2RSTR_TIM8RST		1
//____________RES					[2-3]
#define RCC_APB2RSTR_UART1RST		4
#define RCC_APB2RSTR_UART6RST		5
//____________RES					[6-7]
#define RCC_APB2RSTR_ADCRST			8
//____________RES					[9-10]
#define RCC_APB2RSTR_SDIORST		11
#define RCC_APB2RSTR_SPI1RST		12
//____________RES					13
#define RCC_APB2RSTR_SYSCFGRST		14
//____________RES					15
#define RCC_APB2RSTR_TIM9RST		16
#define RCC_APB2RSTR_TIM10RST		17
#define RCC_APB2RSTR_TIM11RST		18
//____________RES					[19-31]

