alishabana99/stm32f407-disc-board-drivers/Lib/memory_map.h
/* #RCC_AHB1ENR ############################ */
#define RCC_AHB1ENR_GPIOAEN			0
#define RCC_AHB1ENR_GPIOBEN			1
#define RCC_AHB1ENR_GPIOCEN			2
#define RCC_AHB1ENR_GPIODEN			3
#define RCC_AHB1ENR_GPIOEEN			4
#define RCC_AHB1ENR_GPIOFEN			5
#define RCC_AHB1ENR_GPIOGEN			6
#define RCC_AHB1ENR_GPIOHEN			7
#define RCC_AHB1ENR_GPIOIEN			8
//____________RES					[9-11]
#define RCC_AHB1ENR_CRCEN			12
//____________RES					[13-17]
#define RCC_AHB1ENR_BKPSRAMEN		18
//____________RES					19
#define RCC_AHB1ENR_CCMDATARAMEN	20
#define RCC_AHB1ENR_DMA1EN			21
#define RCC_AHB1ENR_DMA2EN			22
//____________RES					[23-24]
#define RCC_AHB1ENR_ETHMACEN		25
#define RCC_AHB1ENR_ETHMACTXEN		26
#define RCC_AHB1ENR_ETHMACRXEN		27
#define RCC_AHB1ENR_ETHMACPTPEN		28
#define RCC_AHB1ENR_OTGHSEN			29
#define RCC_AHB1ENR_OTGHSULPIEN		30
//____________RES					31

/* #RCC_AHB2ENR ############################ */
#define RCC_AHB2ENR_DCMIEN			0
//____________RES					[1-3]
#define RCC_AHB2ENR_CRYPEN			4
#define RCC_AHB2ENR_HASHEN			5
#define RCC_AHB2ENR_RNGEN			6
#define RCC_AHB2ENR_OTGFSEN			7
//____________RES					[8-31]

/* #RCC_AHB3ENR ############################ */
#define RCC_AHB3ENR_FSMCEN			0
//____________RES					[1-31]

/* #RCC_APB1ENR ############################ */
#define RCC_APB1ENR_TIM2EN		0
#define RCC_APB1ENR_TIM3EN		1
#define RCC_APB1ENR_TIM4EN		2
#define RCC_APB1ENR_TIM5EN		3
#define RCC_APB1ENR_TIM6EN		4
#define RCC_APB1ENR_TIM7EN		5
#define RCC_APB1ENR_TIM12EN		6
#define RCC_APB1ENR_TIM13EN		7
#define RCC_APB1ENR_TIM14EN		8
//____________RES				[9-10]
#define RCC_APB1ENR_WWDGEN		11
//____________RES				[12-13]
#define RCC_APB1ENR_SPI2EN		14
#define RCC_APB1ENR_SPI3EN		15
//____________RES				16
#define RCC_APB1ENR_UART2EN		17
#define RCC_APB1ENR_UART3EN		18
#define RCC_APB1ENR_UART4EN		19
#define RCC_APB1ENR_UART5EN		20
#define RCC_APB1ENR_I2C1EN		21
#define RCC_APB1ENR_I2C2EN		22
#define RCC_APB1ENR_I2C3EN		23
//____________RES				24
#define RCC_APB1ENR_CAN1EN		25
#define RCC_APB1ENR_CAN2EN		26
//____________RES				27
#define RCC_APB1ENR_PWREN		28
#define RCC_APB1ENR_DACEN		29
//____________RES				[30-31]

/* #RCC_APB2ENR ############################ */
#define RCC_APB2ENR_TIM1EN		0
#define RCC_APB2ENR_TIM8EN		1
//____________RES				[2-3]
#define RCC_APB2ENR_UART1EN		4
#define RCC_APB2ENR_UART6EN		5
//____________RES				[6-7]
#define RCC_APB2ENR_ADC1EN		8
#define RCC_APB2ENR_ADC2EN		9
#define RCC_APB2ENR_ADC3EN		10

#define RCC_APB2ENR_SDIOEN		11
#define RCC_APB2ENR_SPI1EN		12
//____________RES				13
#define RCC_APB2ENR_SYSCFGEN	14
//____________RES				15
#define RCC_APB2ENR_TIM9EN		16
#define RCC_APB2ENR_TIM10EN		17
#define RCC_APB2ENR_TIM11EN		18
//____________RES				[19-31]


///////////LOW POWER REGs////////////

/* #RCC_AHB1LPENR ############################ */
#define RCC_AHB1LPENR_GPIOALPEN			0
#define RCC_AHB1LPENR_GPIOBLPEN			1
#define RCC_AHB1LPENR_GPIOCLPEN			2
#define RCC_AHB1LPENR_GPIODLPEN			3
#define RCC_AHB1LPENR_GPIOELPEN			4
#define RCC_AHB1LPENR_GPIOFLPEN			5
#define RCC_AHB1LPENR_GPIOGLPEN			6
#define RCC_AHB1LPENR_GPIOHLPEN			7
#define RCC_AHB1LPENR_GPIOILPEN			8
//____________RES					[9-11]
#define RCC_AHB1LPENR_CRCLPEN			12
//____________RES					[13-14]
#define RCC_AHB1LPENR_FLITFLPEN			15
#define RCC_AHB1LPENR_SRAM1LPEN			16
#define RCC_AHB1LPENR_SRAM2LPEN			17
#define RCC_AHB1LPENR_BKPSRAMLPEN		18
//____________RES						[19-20]
#define RCC_AHB1LPENR_DMA1LPEN			21
#define RCC_AHB1LPENR_DMA2LPEN			22
//____________RES					[23-24]
#define RCC_AHB1LPENR_ETHMACLPEN		25
#define RCC_AHB1LPENR_ETHMACTXLPEN		26
#define RCC_AHB1LPENR_ETHMACRXLPEN		27
#define RCC_AHB1LPENR_ETHMACPTPLPEN		28
#define RCC_AHB1LPENR_OTGHSLPEN			29
#define RCC_AHB1LPENR_OTGHSULPILPEN		30
//____________RES					31

/* #RCC_AHB2LPENR ############################ */
#define RCC_AHB2LPENR_DCMILPEN			0
//____________RES					[1-3]
#define RCC_AHB2LPENR_CRYPLPEN			4
#define RCC_AHB2LPENR_HASHLPEN			5
#define RCC_AHB2LPENR_RNGLPEN			6
#define RCC_AHB2LPENR_OTGFSLPEN			7
//____________RES					[8-31]

/* #RCC_AHB3LPENR ############################ */
#define RCC_AHB3LPENR_FSMCLPEN			0
//____________RES					[1-31]

/* #RCC_APB1LPENR ############################ */
#define RCC_APB1LPENR_TIM2LPEN		0
#define RCC_APB1LPENR_TIM3LPEN		1
#define RCC_APB1LPENR_TIM4LPEN		2
#define RCC_APB1LPENR_TIM5LPEN		3
#define RCC_APB1LPENR_TIM6LPEN		4
#define RCC_APB1LPENR_TIM7LPEN		5
#define RCC_APB1LPENR_TIM12LPEN		6
#define RCC_APB1LPENR_TIM13LPEN		7
#define RCC_APB1LPENR_TIM14LPEN		8
//____________RES				[9-10]
#define RCC_APB1LPENR_WWDGLPEN		11
//____________RES				[12-13]
#define RCC_APB1LPENR_SPI2LPEN		14
#define RCC_APB1LPENR_SPI3LPEN		15
//____________RES					16
#define RCC_APB1LPENR_UART2LPEN		17
#define RCC_APB1LPENR_UART3LPEN		18
#define RCC_APB1LPENR_UART4LPEN		19
#define RCC_APB1LPENR_UART5LPEN		20
#define RCC_APB1LPENR_I2C1LPEN		21
#define RCC_APB1LPENR_I2C2LPEN		22
#define RCC_APB1LPENR_I2C3LPEN		23
//____________RES					24
#define RCC_APB1LPENR_CAN1LPEN		25
#define RCC_APB1LPENR_CAN2LPEN		26
//____________RES					27
#define RCC_APB1LPENR_PWRLPEN		28
#define RCC_APB1LPENR_DACLPEN		29
//____________RES				[30-31]

/* #RCC_APB2LPENR ############################ */
#define RCC_APB2LPENR_TIM1LPEN		0
#define RCC_APB2LPENR_TIM8LPEN		1
//____________RES					[2-3]
#define RCC_APB2LPENR_UART1LPEN		4
#define RCC_APB2LPENR_UART6LPEN		5
//____________RES					[6-7]
#define RCC_APB2LPENR_ADC1LPEN		8
#define RCC_APB2LPENR_ADC2LPEN		9
#define RCC_APB2LPENR_ADC3LPEN		10
#define RCC_APB2LPENR_SDIOLPEN		11
#define RCC_APB2LPENR_SPI1LPEN		12
//____________RES					13
#define RCC_APB2LPENR_SYSCFGLPEN	14
//____________RES					15
#define RCC_APB2LPENR_TIM9LPEN		16
#define RCC_APB2LPENR_TIM10LPEN		17
#define RCC_APB2LPENR_TIM11LPEN		18
//____________RES					[19-31]


/* #RCC_BDCR ############################ */
#define RCC_BDCR_LSEON				0
#define RCC_BDCR_LSERDY				1
#define RCC_BDCR_LSEBYP				2
//____________RES					[3-7]
#define RCC_BDCR_RTCSEL				8	//[8-9]
//____________RES					[10-14]
#define RCC_BDCR_RTCEN				15
#define RCC_BDCR_BDRST				16
//____________RES					[17-31]

/* #RCC_CSR ############################ */
#define RCC_CSR_LSION				0
#define	RCC_CSR_LSIRDY				1
//____________RES					[2-23]
#define	RCC_CSR_RMVF				24
#define	RCC_CSR_BORRSTF				25
#define	RCC_CSR_PINRSTF				26
#define	RCC_CSR_PORRSTF				27
#define	RCC_CSR_SFTRSTF				28
#define	RCC_CSR_IWDGRSTF			29
#define	RCC_CSR_WWDGRSTF			30
#define	RCC_CSR_LPWRRSTF			31

