alishabana99/stm32f407-disc-board-drivers/Lib/memory_map.h
/* #RCC_SSCGR ############################ */
#define RCC_RCC_SSCGR_MODPER		0	//[0-12]
#define RCC_RCC_SSCGR_INCSTEP		13	//[13-27]
//____________RES					[28-29]
#define RCC_RCC_SSCGR_SPREADSEL		30
#define RCC_RCC_SSCGR_SSCGEN		31

/* #RCC_PLLI2SCFGR ############################ */
//____________RES						[0-5]
#define RCC_RCC_PLLI2SCFGR_PLLI2SN0		6
#define RCC_RCC_PLLI2SCFGR_PLLI2SN1		7
#define RCC_RCC_PLLI2SCFGR_PLLI2SN2		8
#define RCC_RCC_PLLI2SCFGR_PLLI2SN3		9
#define RCC_RCC_PLLI2SCFGR_PLLI2SN4		10
#define RCC_RCC_PLLI2SCFGR_PLLI2SN5		11
#define RCC_RCC_PLLI2SCFGR_PLLI2SN6		12
#define RCC_RCC_PLLI2SCFGR_PLLI2SN7		13
#define RCC_RCC_PLLI2SCFGR_PLLI2SN8		14
//____________RES						[15-27]
#define RCC_RCC_PLLI2SCFGR_PLLI2SR0		28
#define RCC_RCC_PLLI2SCFGR_PLLI2SR1		29
#define RCC_RCC_PLLI2SCFGR_PLLI2SR2		30
//____________RES						31





/*____________________________________________________________________________________________*/
/*___________________________________ SysTick Registers Bits _________________________________*/
/*____________________________________________________________________________________________*/

/* #SysTick_CSR Register ############################ */

#define SysTick_CSR_ENABLE				0
#define SysTick_CSR_TICKINT				1
#define SysTick_CSR_CLKSOURCE			2
//____________RES						[3-15]
#define SysTick_CSR_COUNTFLAG			16
//____________RES						[17-31]

/* #SysTick_RVR Register ############################ */
#define SysTick_RVR_LOAD //RELOAD		0	//[0-23]
//____________RES						[24-31]

/* #SysTick_CVR Register ############################ */
#define SysTick_CVR_CURRENT				0	//[0-23]
//____________RES						[24-31]

/* #SysTick_CALIB Register ############################ */
#define SysTick_CALIB_TENMS				0	//[0-23]
//____________RES						[24-29]
#define SysTick_CALIB_SKEW				30
#define SysTick_CALIB_NOREF				31


/*____________________________________________________________________________________________*/
/*___________________________________ SysTick Registers Bits _________________________________*/
/*____________________________________________________________________________________________*/
/* #USART_SR Register ############################ */
#define USART_SR_PE				0
#define USART_SR_FE				1
#define USART_SR_NF				2
#define USART_SR_ORE			3
#define USART_SR_IDLE			4
#define USART_SR_RXNE			5
#define USART_SR_TC				6
#define USART_SR_TXE			7
#define USART_SR_LBD			8
#define USART_SR_CTS			9
//____________RES				[10-31]

/* #USART_DR Register ############################ */
#define USART_DR_DATA			0	//[0-8]
//____________RES				[9-31]

/* #USART_BRR Register ############################ */
#define USART_BRR_DIV_FRAC		0	//[0-3]
#define USART_BRR_DIV_MANTISSA	4	//[4-15]
//____________RES				[16-31]

/* #USART_CR1 Register ############################ */
#define USART_CR1_SBK			0
#define USART_CR1_RWU			1
#define USART_CR1_RE			2
#define USART_CR1_TE			3
#define USART_CR1_IDLEIE		4
#define USART_CR1_RXNEIE		5
#define USART_CR1_TCIE			6
#define USART_CR1_TXEIE			7
#define USART_CR1_PEIE			8
#define USART_CR1_PS			9
#define USART_CR1_PCE			10
#define USART_CR1_WAKE			11
#define USART_CR1_M				12
#define USART_CR1_UE			13
//____________RES				14
#define USART_CR1_OVER8			15
//____________RES				[16-31]

/* #USART_CR2 Register ############################ */
#define USART_CR2_ADD			0	//[0-3]
//____________RES				4
#define USART_CR2_LBDIE			6
//____________RES				7
#define USART_CR2_LBCL			8
#define USART_CR2_CPHA			9
#define USART_CR2_CPOL			10
#define USART_CR2_CLKEN			11
#define USART_CR2_STOP			12	//[12-13]
//____________RES				[15-31]

/* #USART_CR3 Register ############################ */
#define USART_CR3_EIE			0
#define USART_CR3_IREN			1
#define USART_CR3_IRLP			2
#define USART_CR3_HDSEL			3
#define USART_CR3_NACK			4
#define USART_CR3_SCEN			5
#define USART_CR3_DMAR			6
#define USART_CR3_DMAT			7
#define USART_CR3_RTSE			8
#define USART_CR3_CTSE			9
#define USART_CR3_CTSIE			10
#define USART_CR3_ONEBIT		11
//____________RES				[12-31]

/* #USART_GTPR Register ############################ */
#define USART_GTPR_PSC			0	//[0-7]
#define USART_GTPR_GT			8	//[8-15]
//____________RES				[16-31]



/*____________________________________________________________________________________________*/
/*____________________________________ ADC Registers Bits _____________________________________*/
/*____________________________________________________________________________________________*/

/* #ADC_SR ############################ */
#define ADC_SR_AWD				0
#define ADC_SR_EOC				1
#define ADC_SR_JEOC				2
#define ADC_SR_JSTRT			3
#define ADC_SR_STRT				4
#define ADC_SR_OVR				5
//____________RES				[6-31]

/* #ADC_CR1 ############################ */
#define ADC_CR1_AWDCH			0 //[0-4]
#define ADC_CR1_EOCIE			5
#define ADC_CR1_AWDIE			6
#define ADC_CR1_JEOCIE			7
#define ADC_CR1_SCAN			8
#define ADC_CR1_AWDSGL			9
#define ADC_CR1_JAUTO			10
#define ADC_CR1_DISCEN			11
#define ADC_CR1_JDISCEN			12
#define ADC_CR1_DISCNUM			13	//[13-15]
//____________RES				[16-21]
#define ADC_CR1_JAWDEN			22
#define ADC_CR1_AWDEN			23
#define ADC_CR1_RES				24	//[24-25]
#define ADC_CR1_OVRIE			26
//____________RES				[27-31]


/* #ADC_CR2 ############################ */
#define ADC_CR2_ADON			0
#define ADC_CR2_CONT			1
//____________RES				[2-7]
#define ADC_CR2_DMA				8
#define ADC_CR2_DDS				9
#define ADC_CR2_EOCS			10
#define ADC_CR2_ALIGN			11
//____________RES				[12-15]
#define ADC_CR2_JEXTSEL			16	//[16-19]
#define ADC_CR2_JEXTEN			20	//[20-21]
#define ADC_CR2_JSWSTART		22
//____________RES				23
#define ADC_CR2_EXTSEL			24	//[24-27]
#define ADC_CR2_EXTEN			28	//[28-29]
#define ADC_CR2_SWSTART			30
//____________RES				31


/* #ADC_SMPR1 ############################ */
#define ADC_SMPR1_SMP10			0 //[0-2]
#define ADC_SMPR1_SMP11			3 //[3-5]
#define ADC_SMPR1_SMP12			6 //[6-8]
#define ADC_SMPR1_SMP13			9 //[9-11]
#define ADC_SMPR1_SMP14			12 //[12-14]
#define ADC_SMPR1_SMP15			15 //[15-17]
#define ADC_SMPR1_SMP16			18 //[18-20]
#define ADC_SMPR1_SMP17			21 //[21-23]
#define ADC_SMPR1_SMP18			24 //[24-26]
//____________RES				[27-31]

/* #ADC_SMPR2 ############################ */
#define ADC_SMPR2_SMP0			0 //[0-2]
#define ADC_SMPR2_SMP1			3 //[3-5]
#define ADC_SMPR2_SMP2			6 //[6-8]
#define ADC_SMPR2_SMP3			9 //[9-11]
#define ADC_SMPR2_SMP4			12 //[12-14]
#define ADC_SMPR2_SMP5			15 //[15-17]
#define ADC_SMPR2_SMP6			18 //[18-20]
#define ADC_SMPR2_SMP7			21 //[21-23]
#define ADC_SMPR2_SMP8			24 //[24-26]
#define ADC_SMPR2_SMP9			27 //[27-29]
//____________RES				[30-31]

