alishabana99/stm32f407-disc-board-drivers/Lib/memory_map.h
/* #ADC_SQR1 ############################ */
#define ADC_SQR1_SQ13			0 //[0-4]
#define ADC_SQR1_SQ14			5 //[5-9]
#define ADC_SQR1_SQ15			10 //[10-14]
#define ADC_SQR1_SQ116			15 //[15-19]
#define ADC_SQR1_L				20 //[20-23]
//____________RES				[24-31]


/* #ADC_SQR2 ############################ */
#define ADC_SQR2_SQ7			0 //[0-4]
#define ADC_SQR2_SQ8			5 //[5-9]
#define ADC_SQR2_SQ9			10 //[10-14]
#define ADC_SQR2_SQ10			15 //[15-19]
#define ADC_SQR2_SQ11			20 //[20-24]
#define ADC_SQR2_SQ12			25 //[25-29]
//____________RES				[30-31]


/* #ADC_SQR3 ############################ */
#define ADC_SQR3_SQ1			0 //[0-4]
#define ADC_SQR3_SQ2			5 //[5-9]
#define ADC_SQR3_SQ3			10 //[10-14]
#define ADC_SQR3_SQ4			15 //[15-19]
#define ADC_SQR3_SQ5			20 //[20-24]
#define ADC_SQR3_SQ6			25 //[25-29]
//____________RES				[30-31]


/* #ADC_JSQR ############################ */
#define ADC_JSQR_JSQ1			0 //[0-4]
#define ADC_JSQR_JSQ2			5 //[5-9]
#define ADC_JSQR_JSQ3			10 //[10-14]
#define ADC_JSQR_JSQ4			15 //[15-19]
#define ADC_JSQR_JL				20 //[20-21]
//____________RES				[22-31]


/*____________________________________________________________________________________________*/
/*____________________________________ ADC Common Registers Bits _____________________________________*/
/*____________________________________________________________________________________________*/
/* #ADC_CSR ############################ */
#define ADC_CSR_AWD1			0
#define ADC_CSR_EOC1			1
#define ADC_CSR_JEOC1			2
#define ADC_CSR_JSTRT1			3
#define ADC_CSR_STRT1			4
#define ADC_CSR_OVR1			5
//____________RES				[6-7]
#define ADC_CSR_AWD2			8
#define ADC_CSR_EOC2			9
#define ADC_CSR_JEOC2			10
#define ADC_CSR_JSTRT2			11
#define ADC_CSR_STRT2			12
#define ADC_CSR_OVR2			13
//____________RES				[14-15]
#define ADC_CSR_AWD3			16
#define ADC_CSR_EOC3			17
#define ADC_CSR_JEOC3			18
#define ADC_CSR_JSTRT3			19
#define ADC_CSR_STRT3			20
#define ADC_CSR_OVR3			21
//____________RES				[22-31]

/* #ADC_CCR ############################ */
#define ADC_CCR_MULTI			0	//[0-4]
//____________RES				[5-7]
#define ADC_CCR_DELAY			8	//[8-11]
//____________RES				12
#define ADC_CCR_DDS				13
#define ADC_CCR_DMA				14	//[14-15]
#define ADC_CCR_ADCPRE			16	//[16-17]
//____________RES				[18-21]
#define ADC_CCR_VBATE			22
#define ADC_CCR_TSVREF			23
//____________RES				[24-31]









#endif /* MEMORY_MAP_H_ */
